# AnalysisDisplayColorEntry Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorEntry Constructor
AnalysisDisplayColorEntry Class See Also
---
Constructs a new AnalysisDisplayColorEntry with default settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayColorEntry()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AnalysisDisplayColorEntry()
```

# See Also
AnalysisDisplayColorEntry Class
AnalysisDisplayColorEntry Overload
Autodesk.Revit.DB.Analysis Namespace